app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.save
---
INSERT INTO "tasks" ("title", "details", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hi"], ["details", "watch nba"], ["completed", 0], ["created_at", "2021-11-16 02:07:10.708320"], ["updated_at", "2021-11-16 02:07:10.708320"]]

  def update
    @task.update(task_params)
---
UPDATE "tasks" SET "details" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["details", "hello"], ["updated_at", "2021-11-16 02:07:18.524410"], ["id", 1]]